ir_version: 6
producer_name: "keras2onnx"
producer_version: "1.6.0"
domain: "onnx"
model_version: 0
doc_string: ""
graph {
  node {
    input: "sequential_1_input"
    input: "dense_1/kernel:0"
    output: "transformed_tensor3"
    name: "dense_1"
    op_type: "MatMul"
    doc_string: ""
    domain: ""
  }
  node {
    input: "transformed_tensor3"
    input: "dense_1/bias:0"
    output: "biased_tensor_name3"
    name: "Add3"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "biased_tensor_name3"
    input: "dense_2/kernel:0"
    output: "transformed_tensor2"
    name: "dense_2"
    op_type: "MatMul"
    doc_string: ""
    domain: ""
  }
  node {
    input: "transformed_tensor2"
    input: "dense_2/bias:0"
    output: "biased_tensor_name2"
    name: "Add2"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "biased_tensor_name2"
    output: "dense_2/Relu:0"
    name: "Relu1"
    op_type: "Relu"
    domain: ""
  }
  node {
    input: "dense_2/Relu:0"
    input: "dense_3/kernel:0"
    output: "transformed_tensor1"
    name: "dense_3"
    op_type: "MatMul"
    domain: ""
  }
  node {
    input: "transformed_tensor1"
    input: "dense_3/bias:0"
    output: "biased_tensor_name1"
    name: "Add1"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "biased_tensor_name1"
    output: "dense_3/Relu:0"
    name: "Relu"
    op_type: "Relu"
    domain: ""
  }
  node {
    input: "dense_3/Relu:0"
    input: "dense_4/kernel:0"
    output: "transformed_tensor"
    name: "dense_4"
    op_type: "MatMul"
    domain: ""
  }
  node {
    input: "transformed_tensor"
    input: "dense_4/bias:0"
    output: "biased_tensor_name"
    name: "Add"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "biased_tensor_name"
    output: "dense_4"
    name: "Sigmoid"
    op_type: "Sigmoid"
    doc_string: ""
    domain: ""
  }
  name: "sequential_1"
  initializer {
    dims: 64
    dims: 1
    data_type: 1
    float_data: -0.20236777
    float_data: 0.6526543
    float_data: -0.4417492
    float_data: 0.05437214
    float_data: -0.18693821
    float_data: -0.029510021
    float_data: -0.18292908
    float_data: 0.20018758
    float_data: 0.5655898
    float_data: -0.06043264
    float_data: 0.24852628
    float_data: -0.084520414
    float_data: 0.24096821
    float_data: 0.0031869493
    float_data: -0.140773
    float_data: 0.42369914
    float_data: -0.2675131
    float_data: 0.2641267
    float_data: 0.27897406
    float_data: 0.18537731
    float_data: -0.3833594
    float_data: 0.47155076
    float_data: 0.067377985
    float_data: -0.31331638
    float_data: 0.6297563
    float_data: 0.10965595
    float_data: -0.5359844
    float_data: 0.27620283
    float_data: -0.6836226
    float_data: 0.32547373
    float_data: -0.6351767
    float_data: -0.38409266
    float_data: -0.7935299
    float_data: -0.39245465
    float_data: 0.28243235
    float_data: 0.107207716
    float_data: -0.2508847
    float_data: -0.42369297
    float_data: 0.30748543
    float_data: 0.0676073
    float_data: 0.22562282
    float_data: -0.47596624
    float_data: -0.5982229
    float_data: -0.47628874
    float_data: -0.30789614
    float_data: -0.25252035
    float_data: -0.40396875
    float_data: 0.5624506
    float_data: -0.13855243
    float_data: 0.36594528
    float_data: -0.032676533
    float_data: 0.107921824
    float_data: -0.12459919
    float_data: -0.00059049035
    float_data: 0.033245835
    float_data: -0.29103932
    float_data: 0.097012565
    float_data: -0.71039325
    float_data: 0.23520124
    float_data: 0.4421495
    float_data: 0.37656334
    float_data: 0.121105775
    float_data: 0.16924328
    float_data: -0.17247976
    name: "dense_4/kernel:0"
  }
  initializer {
    dims: 1
    data_type: 1
    float_data: 0.16381039
    name: "dense_4/bias:0"
  }
  initializer {
    dims: 32
    dims: 64
    data_type: 1
    float_data: -0.18306014
    float_data: 0.03461628
    float_data: 0.042049155
    float_data: -0.24918064
    float_data: -0.033614874
    float_data: -0.043601632
    float_data: -0.10315871
    float_data: 0.008968821
    float_data: 0.12242503
    float_data: 0.08551484
    float_data: 0.16798568
    float_data: 0.011037611
    float_data: -0.14045547
    float_data: 0.0020278061
    float_data: -0.035708226
    float_data: 0.12309051
    float_data: 0.20472676
    float_data: -0.039572675
    float_data: 0.038431946
    float_data: -0.025699439
    float_data: -0.118635245
    float_data: -0.13776869
    float_data: -0.20459394
    float_data: 0.013815453
    float_data: -0.12685688
    float_data: 0.07046497
    float_data: -0.082378626
    float_data: 0.0027937866
    float_data: 0.048313458
    float_data: 0.07510581
    float_data: -0.050457343
    float_data: 0.15731387
    float_data: 0.20888
    float_data: 0.20835851
    float_data: 0.1228748
    float_data: 0.08799487
    float_data: -0.07325739
    float_data: 0.08627369
    float_data: -0.118325904
    float_data: -0.20595264
    float_data: 0.052967776
    float_data: 0.16035898
    float_data: 0.09639996
    float_data: -0.0029749156
    float_data: 0.19899504
    float_data: -0.12434965
    float_data: -0.21548049
    float_data: 0.1530677
    float_data: -0.07878482
    float_data: -0.056808017
    float_data: 0.117546976
    float_data: 0.024306497
    float_data: 0.14541708
    float_data: -0.21664798
    float_data: -0.018292282
    float_data: 0.1406082
    float_data: 0.12271212
    float_data: 0.1900809
    float_data: -0.14642926
    float_data: 0.24559656
    float_data: -0.08203135
    float_data: -0.1896771
    float_data: -0.22639957
    float_data: 0.24078181
    float_data: -0.13555346
    float_data: -0.15541852
    float_data: 0.25301385
    float_data: 0.24184498
    float_data: -0.005832681
    float_data: 0.1030975
    float_data: 0.029546797
    float_data: -0.17866932
    float_data: -0.29170617
    float_data: -0.13873029
    float_data: -0.1224013
    float_data: -0.17271371
    float_data: -0.0097750705
    float_data: 0.1900131
    float_data: -0.08743376
    float_data: 0.12951155
    float_data: 0.24198982
    float_data: -0.21352537
    float_data: 0.030898938
    float_data: -0.21263576
    float_data: 0.033758305
    float_data: -0.023327926
    float_data: 0.22839433
    float_data: -0.09256606
    float_data: -0.12994654
    float_data: 0.004079342
    float_data: -0.04828555
    float_data: 0.03545553
    float_data: -0.020753229
    float_data: -0.25888497
    float_data: 0.028370177
    float_data: 0.18104395
    float_data: 0.27610373
    float_data: 0.26154882
    float_data: 0.18715787
    float_data: 0.0052232146
    float_data: 0.23639303
    float_data: -0.21536057
    float_data: -0.11585957
    float_data: 0.021449506
    float_data: -0.040239513
    float_data: -0.11192668
    float_data: -0.12885803
    float_data: 0.11231059
    float_data: 0.23453425
    float_data: 0.056190312
    float_data: -0.18773901
    float_data: -0.021680525
    float_data: 0.017950714
    float_data: 0.034911864
    float_data: -0.0573318
    float_data: -0.11718601
    float_data: 0.2254607
    float_data: 0.023827542
    float_data: -0.20458478
    float_data: 0.15708682
    float_data: -0.08976722
    float_data: 0.18519644
    float_data: 0.22198498
    float_data: 0.12780607
    float_data: -0.015865326
    float_data: 0.13583845
    float_data: 0.012069854
    float_data: -0.04090422
    float_data: -0.05251272
    float_data: -0.17879067
    float_data: -0.033094037
    float_data: 0.24683549
    float_data: 0.18855476
    float_data: -0.24493176
    float_data: -0.1065458
    float_data: -0.2299674
    float_data: -0.070226036
    float_data: -0.13445406
    float_data: -0.0016787957
    float_data: 0.13698283
    float_data: -0.024093838
    float_data: 0.10484699
    float_data: -0.09310055
    float_data: 0.121843114
    float_data: -0.11361073
    float_data: 0.00077612797
    float_data: 0.16136771
    float_data: 0.04861492
    float_data: 0.17119193
    float_data: 0.1323511
    float_data: 0.111711316
    float_data: 0.12286549
    float_data: 0.07368607
    float_data: 0.16920225
    float_data: 0.2629034
    float_data: 0.16186208
    float_data: 0.058879957
    float_data: -0.13860527
    float_data: 0.040743437
    float_data: -0.1919318
    float_data: -0.027104873
    float_data: -0.07971466
    float_data: -0.21426599
    float_data: -0.120756805
    float_data: -0.0386104
    float_data: -0.15298663
    float_data: -0.18760104
    float_data: 0.20348254
    float_data: -0.06498435
    float_data: -0.08758065
    float_data: 0.20827362
    float_data: 0.07449718
    float_data: -0.120904095
    float_data: 0.11448133
    float_data: 0.0849489
    float_data: 0.006653849
    float_data: 0.2108012
    float_data: -0.245323
    float_data: 0.22129641
    float_data: -0.09945618
    float_data: -0.07054454
    float_data: -0.06053406
    float_data: -0.16662642
    float_data: -0.07305443
    float_data: 0.09354129
    float_data: -0.14815788
    float_data: 0.124655604
    float_data: -0.11366205
    float_data: 0.042397544
    float_data: -0.043333605
    float_data: -0.13218784
    float_data: -0.14470346
    float_data: 0.2348651
    float_data: -0.19681676
    float_data: 0.17106101
    float_data: 0.21440442
    float_data: 0.18190038
    float_data: -0.16744018
    float_data: -0.04770744
    float_data: -0.22908247
    float_data: -0.27916276
    float_data: -0.08092212
    float_data: 0.042137787
    float_data: 0.12672445
    float_data: -0.19031042
    float_data: -0.02232773
    float_data: 0.14071177
    float_data: 0.002946445
    float_data: -0.12035507
    float_data: -0.0034828654
    float_data: 0.07243682
    float_data: -0.062331617
    float_data: 0.12932111
    float_data: 0.10901453
    float_data: -0.14706886
    float_data: 0.23560442
    float_data: -0.08055555
    float_data: -0.05709815
    float_data: 0.253711
    float_data: 0.21721636
    float_data: -0.22562517
    float_data: -0.2090332
    float_data: 0.35264412
    float_data: -0.081016004
    float_data: 0.2555844
    float_data: 0.11321947
    float_data: 0.02624476
    float_data: -0.091718316
    float_data: 0.20681942
    float_data: -0.06415589
    float_data: -0.27451447
    float_data: 0.055352867
    float_data: 0.016545355
    float_data: 0.17128903
    float_data: 0.23172998
    float_data: 0.21078311
    float_data: 0.045972165
    float_data: -0.038121343
    float_data: -0.06613785
    float_data: -0.31514287
    float_data: -0.106092215
    float_data: -0.0386564
    float_data: -0.12731053
    float_data: -0.06486833
    float_data: -0.11652191
    float_data: -0.088756874
    float_data: -0.17205918
    float_data: 0.18263261
    float_data: 0.006876588
    float_data: 0.30930445
    float_data: -0.27974612
    float_data: -0.11590103
    float_data: 0.10611526
    float_data: 0.11478075
    float_data: 0.17331977
    float_data: 0.08256858
    float_data: -0.15141368
    float_data: 0.02948924
    float_data: 0.105401635
    float_data: -0.14994359
    float_data: 0.09912524
    float_data: 0.06389463
    float_data: -0.033594392
    float_data: 0.10321611
    float_data: 0.029070351
    float_data: -0.16078226
    float_data: 0.17232019
    float_data: 0.079627745
    float_data: 0.2181058
    float_data: 0.21529403
    float_data: -0.23365858
    float_data: 0.13593984
    float_data: -0.051841695
    float_data: -0.015165099
    float_data: 0.17995788
    float_data: -0.20423059
    float_data: -0.15051241
    float_data: 0.19479614
    float_data: 0.14821665
    float_data: 0.042378522
    float_data: 0.15741496
    float_data: -0.12815875
    float_data: 0.18649027
    float_data: 0.110862836
    float_data: -0.072992004
    float_data: -0.18991551
    float_data: 0.13632184
    float_data: -0.07719831
    float_data: -0.07476796
    float_data: 0.11640403
    float_data: -0.014741171
    float_data: 0.24447805
    float_data: -0.124261856
    float_data: -0.25319606
    float_data: 0.20460653
    float_data: 0.08341216
    float_data: -0.109769166
    float_data: 0.057127625
    float_data: -0.17688759
    float_data: 0.10665763
    float_data: -0.2109589
    float_data: -0.12421
    float_data: -0.22997317
    float_data: -0.12395614
    float_data: -0.07338263
    float_data: 0.083132565
    float_data: 0.20364624
    float_data: 0.06066746
    float_data: 0.06444342
    float_data: -0.08349972
    float_data: -0.10653434
    float_data: 0.06670956
    float_data: -0.23565055
    float_data: 0.05239028
    float_data: -0.19577336
    float_data: -0.17364933
    float_data: 0.26001334
    float_data: -0.22912735
    float_data: 0.17415293
    float_data: -0.12525247
    float_data: -0.17971486
    float_data: 0.104256324
    float_data: 0.1015954
    float_data: -0.2503063
    float_data: 0.16245323
    float_data: -0.016665697
    float_data: -0.1803594
    float_data: 0.22436011
    float_data: 0.09315455
    float_data: 0.16148853
    float_data: -0.22774653
    float_data: 0.070929214
    float_data: 0.24256082
    float_data: -0.06581466
    float_data: -0.012233497
    float_data: 0.23811103
    float_data: 0.19853318
    float_data: 0.027947659
    float_data: 0.1860436
    float_data: -0.121426135
    float_data: 0.04336369
    float_data: -0.23426658
    float_data: 0.14807151
    float_data: -0.09883827
    float_data: 0.12856025
    float_data: 0.08022978
    float_data: 0.2899948
    float_data: -0.21726312
    float_data: -0.024124106
    float_data: -0.11627413
    float_data: -0.11166984
    float_data: 0.22488292
    float_data: -0.17337143
    float_data: 0.042928338
    float_data: 0.22641788
    float_data: -0.15478718
    float_data: -0.18515402
    float_data: -0.113085315
    float_data: -0.0958744
    float_data: -0.18118095
    float_data: 0.036291756
    float_data: 0.12147188
    float_data: -0.23406523
    float_data: 0.25410843
    float_data: 0.08346951
    float_data: -0.21740323
    float_data: 0.0035279372
    float_data: -0.14867133
    float_data: -0.030153843
    float_data: -0.18631698
    float_data: -0.059552576
    float_data: 0.0833419
    float_data: 0.043178737
    float_data: -0.0111554265
    float_data: -0.14908388
    float_data: -0.13978887
    float_data: 0.21946535
    float_data: -0.15992802
    float_data: 0.17514175
    float_data: -0.14123574
    float_data: -0.16110474
    float_data: -0.24203224
    float_data: 0.053111073
    float_data: -0.12973791
    float_data: -0.07261522
    float_data: 0.17921954
    float_data: -0.22001939
    float_data: -0.03423125
    float_data: 0.07437062
    float_data: 0.06758344
    float_data: -0.052926335
    float_data: -0.05736758
    float_data: 0.04119689
    float_data: -0.22927153
    float_data: 0.017165966
    float_data: -0.118321635
    float_data: -0.14252637
    float_data: -0.037229124
    float_data: 0.21261832
    float_data: 0.015035099
    float_data: -0.1265365
    float_data: -0.17367487
    float_data: -0.100394286
    float_data: -0.19431354
    float_data: -0.27347082
    float_data: 0.1920232
    float_data: -0.17358677
    float_data: -0.2203505
    float_data: 0.19980362
    float_data: 0.17384416
    float_data: -0.18794055
    float_data: -0.021484429
    float_data: 0.30415508
    float_data: -0.033362493
    float_data: -0.03235419
    float_data: 0.1669389
    float_data: 0.17519633
    float_data: -0.2665837
    float_data: 0.12071547
    float_data: 0.14901167
    float_data: 0.19725615
    float_data: -0.112816826
    float_data: -0.026499594
    float_data: -0.08752844
    float_data: -0.18019138
    float_data: -0.26381156
    float_data: 0.07487519
    float_data: 0.21085183
    float_data: -0.036360234
    float_data: -0.16979426
    float_data: 0.21052836
    float_data: -0.0144410115
    float_data: 0.078010865
    float_data: -0.1106144
    float_data: -0.24622898
    float_data: -0.15760434
    float_data: -0.008501001
    float_data: -0.18303548
    float_data: 0.14471139
    float_data: 0.10888439
    float_data: -0.22887999
    float_data: -0.23733258
    float_data: -0.1540101
    float_data: -0.046926398
    float_data: -0.11052844
    float_data: 0.11413342
    float_data: 0.09092368
    float_data: -0.06550118
    float_data: -0.09072095
    float_data: -0.2017157
    float_data: 0.20834303
    float_data: -0.13960063
    float_data: -0.13712281
    float_data: -0.14471799
    float_data: 0.07091712
    float_data: -0.060234487
    float_data: -0.05415415
    float_data: 0.14082402
    float_data: 0.22446072
    float_data: 0.0052710357
    float_data: 0.008900547
    float_data: 0.04874253
    float_data: 0.24598266
    float_data: -0.04722594
    float_data: -0.17820483
    float_data: 0.19872114
    float_data: 0.15923712
    float_data: -0.1835136
    float_data: 0.16974914
    float_data: -0.039335888
    float_data: -0.23214781
    float_data: -0.019544005
    float_data: -0.22172141
    float_data: 0.20654349
    float_data: -0.21239597
    float_data: 0.08301642
    float_data: 0.10738483
    float_data: 0.10001417
    float_data: -0.18807548
    float_data: 0.109555185
    float_data: -0.022416372
    float_data: 0.07331294
    float_data: -0.072650805
    float_data: 0.24820906
    float_data: 0.02286011
    float_data: 0.1517598
    float_data: 0.16232161
    float_data: -0.23356313
    float_data: 0.034402117
    float_data: -0.18757206
    float_data: 0.15667021
    float_data: -0.0901388
    float_data: 0.11837858
    float_data: -0.1590749
    float_data: 0.07982482
    float_data: 0.06664619
    float_data: 0.21435769
    float_data: 0.082695596
    float_data: 0.24417575
    float_data: 0.06863757
    float_data: -0.06553793
    float_data: -0.24613225
    float_data: -0.01694249
    float_data: 0.2203337
    float_data: 0.23364724
    float_data: 0.05871427
    float_data: 0.18838578
    float_data: 0.018399127
    float_data: 0.10287301
    float_data: -0.017741354
    float_data: -0.019265752
    float_data: -0.07228911
    float_data: 0.18169245
    float_data: 0.21476886
    float_data: -0.057647314
    float_data: -0.028345881
    float_data: 0.035560045
    float_data: 0.23732436
    float_data: 0.17843354
    float_data: -0.1384585
    float_data: 0.24290287
    float_data: -0.043667924
    float_data: 0.12477789
    float_data: -0.18518233
    float_data: 0.124279514
    float_data: -0.13966973
    float_data: -0.08010913
    float_data: -0.009697592
    float_data: -0.06468948
    float_data: -0.017417317
    float_data: -0.06771341
    float_data: -0.06258146
    float_data: 0.037589416
    float_data: -0.077608116
    float_data: -0.21435632
    float_data: 0.0069160117
    float_data: -0.0046974416
    float_data: -0.03993914
    float_data: 0.16728702
    float_data: -0.10797203
    float_data: 0.13250102
    float_data: 0.044838615
    float_data: -0.025008678
    float_data: -0.055153836
    float_data: 0.14661902
    float_data: 0.1416743
    float_data: -0.22392517
    float_data: -0.019940317
    float_data: -0.09022796
    float_data: 0.052924376
    float_data: -0.056052923
    float_data: 0.047170293
    float_data: -0.06754148
    float_data: 0.06564128
    float_data: -0.014733849
    float_data: 0.116563395
    float_data: 0.13429548
    float_data: 0.00892663
    float_data: -0.015942406
    float_data: 0.1487771
    float_data: 0.08464368
    float_data: 0.13166057
    float_data: 0.11954427
    float_data: -0.12389135
    float_data: 0.057945434
    float_data: 0.24901116
    float_data: -0.07356651
    float_data: -0.08009212
    float_data: -0.22337599
    float_data: -0.119158536
    float_data: 0.054074284
    float_data: 0.15899004
    float_data: 0.13599008
    float_data: 0.14135079
    float_data: -0.15356874
    float_data: 0.12175805
    float_data: 0.2207936
    float_data: 0.04776944
    float_data: 0.019508343
    float_data: -0.008102987
    float_data: -0.04671004
    float_data: -0.15878403
    float_data: 0.0006196406
    float_data: -0.17060727
    float_data: -0.052000895
    float_data: 0.0010744868
    float_data: -0.05668435
    float_data: 0.041664902
    float_data: 0.1851386
    float_data: 0.030371668
    float_data: -0.15294512
    float_data: -0.017975349
    float_data: -0.0398447
    float_data: 0.24292499
    float_data: 0.11307439
    float_data: 0.168559
    float_data: 0.25672817
    float_data: 0.09564307
    float_data: -0.034421545
    float_data: 0.1472586
    float_data: 0.2539929
    float_data: 0.23006493
    float_data: 0.25419772
    float_data: 0.1118757
    float_data: -0.14067881
    float_data: -0.22021294
    float_data: -0.065398976
    float_data: -0.038194947
    float_data: -0.16405247
    float_data: 0.10441934
    float_data: -0.18875152
    float_data: 0.12854606
    float_data: -0.22917736
    float_data: -0.019959824
    float_data: -0.06453509
    float_data: -0.10729347
    float_data: 0.15556675
    float_data: -0.20712309
    float_data: -0.024694856
    float_data: -0.24741054
    float_data: 0.15145607
    float_data: 0.12604558
    float_data: 0.097637095
    float_data: 0.19443266
    float_data: -0.22944471
    float_data: 0.12679513
    float_data: 0.21876411
    float_data: -0.0073809316
    float_data: 0.099081494
    float_data: -0.01862694
    float_data: -0.032217726
    float_data: 0.19785653
    float_data: -0.09993388
    float_data: 0.19550297
    float_data: 0.18177582
    float_data: -0.112913996
    float_data: 0.26427087
    float_data: 0.013552924
    float_data: -0.064170584
    float_data: 0.03049152
    float_data: 0.036922265
    float_data: -0.11619323
    float_data: 0.3379361
    float_data: -0.12199742
    float_data: 0.026732264
    float_data: -0.023884952
    float_data: 0.20206684
    float_data: 0.059740037
    float_data: -0.27646852
    float_data: -0.11190616
    float_data: -0.024953665
    float_data: 0.17719579
    float_data: -0.056446485
    float_data: -0.13159761
    float_data: 0.24301776
    float_data: -0.051460233
    float_data: 0.09640539
    float_data: -0.22003962
    float_data: 0.13479243
    float_data: -0.13201189
    float_data: 0.21882148
    float_data: -0.08790998
    float_data: -0.23004319
    float_data: 0.09017251
    float_data: -0.29759133
    float_data: -0.14752007
    float_data: 0.3189471
    float_data: 0.23666354
    float_data: 0.014617902
    float_data: 0.112127006
    float_data: 0.3712769
    float_data: 0.07167917
    float_data: 0.26482803
    float_data: 0.016536394
    float_data: -0.15022236
    float_data: 0.20545012
    float_data: 0.07601243
    float_data: -0.096467525
    float_data: 0.09730599
    float_data: -0.20146596
    float_data: -0.1963396
    float_data: 0.12702721
    float_data: 0.12352824
    float_data: 0.068886094
    float_data: 0.04985023
    float_data: 0.21012676
    float_data: -0.15759656
    float_data: -0.18457265
    float_data: -0.1140576
    float_data: -0.31459835
    float_data: 0.22398742
    float_data: -0.18441093
    float_data: 0.22939995
    float_data: -0.098230325
    float_data: 0.18801814
    float_data: 0.19573599
    float_data: -0.0683077
    float_data: 0.25379467
    float_data: 0.1722907
    float_data: 0.1282388
    float_data: -0.28754795
    float_data: 0.13161819
    float_data: -0.07232347
    float_data: 0.10818358
    float_data: -0.015398828
    float_data: -0.228911
    float_data: 0.11410536
    float_data: -0.1808481
    float_data: 7.347343e-05
    float_data: -0.2323882
    float_data: 0.104729176
    float_data: 0.23057073
    float_data: 0.0813999
    float_data: 0.10863052
    float_data: -0.063439846
    float_data: 0.23847212
    float_data: -0.16645484
    float_data: -0.13925557
    float_data: 0.12734185
    float_data: -0.04462121
    float_data: -0.08879181
    float_data: 0.03441221
    float_data: -0.17854059
    float_data: -0.09077847
    float_data: 0.17078316
    float_data: -0.12951007
    float_data: -0.22107005
    float_data: -0.006703986
    float_data: -0.04026953
    float_data: 0.17280519
    float_data: -0.1477966
    float_data: -0.23200879
    float_data: -0.22517042
    float_data: 0.0017442934
    float_data: -0.20242135
    float_data: 0.20940849
    float_data: -0.013508754
    float_data: 0.09176199
    float_data: -0.022075653
    float_data: 0.024981797
    float_data: -0.15613192
    float_data: 0.08566793
    float_data: 0.21866278
    float_data: -0.19256061
    float_data: 0.24163973
    float_data: -0.21752457
    float_data: 0.255493
    float_data: -0.24671215
    float_data: -0.15393142
    float_data: 0.07614887
    float_data: -0.15883884
    float_data: 0.06940349
    float_data: 0.16947693
    float_data: -0.24761221
    float_data: 0.1319133
    float_data: -0.08776784
    float_data: 0.117848024
    float_data: 0.13611111
    float_data: 0.12074129
    float_data: 0.08802325
    float_data: -0.22064573
    float_data: -0.12634434
    float_data: 0.019236952
    float_data: 0.13364376
    float_data: -0.10877235
    float_data: -0.13231316
    float_data: 0.043153476
    float_data: -0.10530781
    float_data: 0.04081201
    float_data: -0.15709746
    float_data: -0.248721
    float_data: 0.09353511
    float_data: -0.056889772
    float_data: -0.05554557
    float_data: -0.014265493
    float_data: -0.23103225
    float_data: -0.22357067
    float_data: 0.084771775
    float_data: -0.21285744
    float_data: -0.17414862
    float_data: -0.13552679
    float_data: -0.15831417
    float_data: 0.046150558
    float_data: -0.08626648
    float_data: -0.080212146
    float_data: 0.009581175
    float_data: 0.172891
    float_data: 0.1715887
    float_data: -0.12615523
    float_data: 0.24697882
    float_data: -0.1734443
    float_data: 0.08013033
    float_data: 0.21206479
    float_data: 0.0036107898
    float_data: -0.18507433
    float_data: 0.07930649
    float_data: -0.10872148
    float_data: -0.2652004
    float_data: 0.18012781
    float_data: 0.22304782
    float_data: 0.18536428
    float_data: -0.14909023
    float_data: 0.069244646
    float_data: -0.13454098
    float_data: 0.042158008
    float_data: 0.14951713
    float_data: -0.097951464
    float_data: 0.15263304
    float_data: -0.10956019
    float_data: 0.15156998
    float_data: -0.040388525
    float_data: -0.13963844
    float_data: 0.14945859
    float_data: -0.1308729
    float_data: -0.0300626
    float_data: 0.13396557
    float_data: 0.23381889
    float_data: -0.08895798
    float_data: -0.13401659
    float_data: 0.242653
    float_data: 0.035986252
    float_data: -0.023611015
    float_data: -0.19567586
    float_data: -0.14052412
    float_data: -0.10872098
    float_data: 0.034279328
    float_data: 0.039992984
    float_data: 0.06534173
    float_data: 0.02761788
    float_data: 0.22721294
    float_data: 0.19537161
    float_data: -0.07029461
    float_data: 0.09075148
    float_data: 0.24827455
    float_data: 0.19968025
    float_data: 0.0017945508
    float_data: -0.102256685
    float_data: -0.064001024
    float_data: -0.20903091
    float_data: -0.13045698
    float_data: 0.09869133
    float_data: -0.2133559
    float_data: -0.0008814655
    float_data: 0.12516294
    float_data: -0.10140604
    float_data: -0.1610995
    float_data: -0.08427685
    float_data: 0.117198475
    float_data: 0.20898208
    float_data: -0.045503054
    float_data: -0.05805154
    float_data: 0.16763692
    float_data: -0.08318376
    float_data: 0.2593076
    float_data: 0.23424812
    float_data: 0.103506945
    float_data: 0.085339755
    float_data: -0.052573264
    float_data: -0.14914732
    float_data: 0.04207722
    float_data: -0.041441247
    float_data: -0.067181446
    float_data: 0.22256391
    float_data: -0.19996274
    float_data: 0.051081885
    float_data: 0.26288453
    float_data: 0.023015002
    float_data: -0.15101975
    float_data: -0.23119092
    float_data: -0.005222391
    float_data: -0.05434171
    float_data: 0.046973526
    float_data: -0.0010046577
    float_data: -0.14454521
    float_data: 0.0820256
    float_data: 0.008736043
    float_data: -0.17594099
    float_data: -0.14899361
    float_data: 0.06353139
    float_data: 0.17806444
    float_data: -0.24032396
    float_data: 0.19875592
    float_data: 0.18747312
    float_data: 0.048821315
    float_data: -0.14573291
    float_data: 0.10854411
    float_data: -0.10536062
    float_data: 0.043581888
    float_data: 0.23500046
    float_data: -0.12779304
    float_data: 0.15033074
    float_data: 0.13902177
    float_data: 0.18036915
    float_data: 0.24271503
    float_data: 0.14442623
    float_data: 0.09034859
    float_data: 0.1116365
    float_data: -0.15453616
    float_data: 0.1079517
    float_data: 0.030181678
    float_data: 0.026328655
    float_data: -0.20511788
    float_data: -0.24831897
    float_data: -0.08755343
    float_data: -0.17049219
    float_data: -0.0740644
    float_data: 0.05231063
    float_data: 0.16838999
    float_data: -0.15194467
    float_data: 0.17849332
    float_data: 0.014327922
    float_data: 0.22631256
    float_data: -0.024430534
    float_data: -0.11522701
    float_data: 0.08588308
    float_data: -0.18291736
    float_data: 0.22283715
    float_data: 0.03569642
    float_data: 0.24949926
    float_data: -0.10743969
    float_data: 0.22017184
    float_data: -0.06463385
    float_data: -0.11767841
    float_data: -0.21761104
    float_data: 0.15406011
    float_data: 0.002097323
    float_data: -0.19922008
    float_data: 0.17569014
    float_data: 0.17011148
    float_data: 0.040118333
    float_data: 0.1632247
    float_data: -0.20535761
    float_data: 0.010905921
    float_data: -0.16809663
    float_data: -0.22399233
    float_data: 0.05005902
    float_data: 0.04530734
    float_data: 0.20673373
    float_data: 0.09381538
    float_data: -0.2532
    float_data: 0.22281563
    float_data: -0.0424847
    float_data: -0.13015652
    float_data: 0.19859058
    float_data: -0.0004878044
    float_data: 0.12561521
    float_data: -0.11699202
    float_data: -0.06490302
    float_data: 0.10076332
    float_data: 0.12216512
    float_data: 0.17303307
    float_data: 0.11022896
    float_data: 0.063516796
    float_data: 0.14485672
    float_data: 0.118241325
    float_data: -0.24643123
    float_data: -0.15000059
    float_data: 0.055221446
    float_data: -0.08917333
    float_data: 0.11973509
    float_data: 0.067771934
    float_data: 0.03846558
    float_data: 0.026710564
    float_data: 0.14076653
    float_data: 0.23453957
    float_data: -0.0051770806
    float_data: -0.18817276
    float_data: -0.20754433
    float_data: 0.09524821
    float_data: 0.19990323
    float_data: 0.032963432
    float_data: 0.10450185
    float_data: -0.0605971
    float_data: 0.18145512
    float_data: 0.2183757
    float_data: -0.0061533633
    float_data: -0.16976444
    float_data: 0.22163872
    float_data: 0.10409112
    float_data: 0.05034358
    float_data: -0.22743943
    float_data: -0.07777674
    float_data: -0.15872712
    float_data: -0.22719444
    float_data: 0.08567755
    float_data: 0.07312009
    float_data: -0.01725015
    float_data: -0.19324574
    float_data: -0.044260167
    float_data: 0.008798155
    float_data: -0.058105174
    float_data: 0.10617651
    float_data: -0.00048911205
    float_data: 0.18347363
    float_data: -0.22467345
    float_data: -0.023984909
    float_data: -0.09059936
    float_data: 0.00048067793
    float_data: -0.050256714
    float_data: -0.15271525
    float_data: 0.14439549
    float_data: -0.10768977
    float_data: -0.16641848
    float_data: 0.022904249
    float_data: 0.19684027
    float_data: -0.24840152
    float_data: 0.15017763
    float_data: 0.05608993
    float_data: -0.027934387
    float_data: -0.054986384
    float_data: 0.13711604
    float_data: -0.08501063
    float_data: -0.15542315
    float_data: -0.10552925
    float_data: -0.07519044
    float_data: 0.029326174
    float_data: -0.010278785
    float_data: -0.2512427
    float_data: -0.12958044
    float_data: -0.20573114
    float_data: 0.12128214
    float_data: -0.24300523
    float_data: 0.0027125399
    float_data: 0.18066828
    float_data: 0.037843704
    float_data: -0.0108637
    float_data: 0.07585278
    float_data: 0.02129196
    float_data: -0.15535975
    float_data: -0.019564152
    float_data: 0.20510255
    float_data: 0.0210064
    float_data: -0.23041351
    float_data: -0.10255259
    float_data: 0.13439833
    float_data: 0.0303333
    float_data: 0.036892015
    float_data: 0.067825295
    float_data: -0.02665095
    float_data: -0.11733748
    float_data: 0.17470981
    float_data: -0.03981022
    float_data: -0.17155436
    float_data: 0.07474462
    float_data: -0.24911928
    float_data: -0.20041874
    float_data: -0.051036593
    float_data: 0.04997531
    float_data: -0.1958981
    float_data: -0.18206565
    float_data: 0.24395606
    float_data: -0.17205124
    float_data: 0.38117394
    float_data: 0.031210424
    float_data: -0.02713008
    float_data: 0.271536
    float_data: 0.34640658
    float_data: 0.15885746
    float_data: 0.0961444
    float_data: -0.041050017
    float_data: 0.059776843
    float_data: 0.0040105833
    float_data: 0.075557314
    float_data: 0.0068210545
    float_data: -0.18582107
    float_data: 0.020696055
    float_data: -0.21349367
    float_data: 0.034788895
    float_data: 0.07495166
    float_data: -0.12688267
    float_data: 0.2024605
    float_data: -0.08622047
    float_data: 0.19914171
    float_data: 0.15439783
    float_data: 0.038326383
    float_data: 0.17385003
    float_data: -0.09540209
    float_data: -0.15843618
    float_data: 0.21735336
    float_data: 0.13411425
    float_data: 0.15422131
    float_data: 0.17469376
    float_data: -0.22696358
    float_data: 0.021390218
    float_data: 0.043299302
    float_data: -0.12727125
    float_data: 0.075843096
    float_data: 0.0086166235
    float_data: -0.25343874
    float_data: 0.17534456
    float_data: -0.17230713
    float_data: -0.005984289
    float_data: 0.15510054
    float_data: -0.11905122
    float_data: -0.03385396
    float_data: -0.08130365
    float_data: -0.00081584824
    float_data: -0.16575104
    float_data: -0.022165269
    float_data: -0.087015405
    float_data: -0.058617633
    float_data: 0.057358272
    float_data: -0.019694122
    float_data: -0.012210172
    float_data: -0.10109304
    float_data: -0.06436955
    float_data: 0.123288326
    float_data: -0.13332042
    float_data: -0.1309342
    float_data: 0.10780356
    float_data: -0.19358
    float_data: -0.25034267
    float_data: -0.11116951
    float_data: -0.07224948
    float_data: 0.19423577
    float_data: -0.19361442
    float_data: 0.09722073
    float_data: 0.23840071
    float_data: -0.04715177
    float_data: -0.09778123
    float_data: 0.09112329
    float_data: -0.16632275
    float_data: -0.019765563
    float_data: 0.10425109
    float_data: 0.06521821
    float_data: 0.12505813
    float_data: -0.054134198
    float_data: 0.06308366
    float_data: -0.16906051
    float_data: 0.005456526
    float_data: -0.05635377
    float_data: -0.016619965
    float_data: 0.1586132
    float_data: 0.03790599
    float_data: 0.22884466
    float_data: -0.23561999
    float_data: 0.016855497
    float_data: 0.060868334
    float_data: -0.24421553
    float_data: 0.09574528
    float_data: 0.14186089
    float_data: -0.035522588
    float_data: -0.1703723
    float_data: 0.110991515
    float_data: -0.012849987
    float_data: 0.20520908
    float_data: -0.18854357
    float_data: -0.15632927
    float_data: 0.16050103
    float_data: 0.24378671
    float_data: 0.024624985
    float_data: 0.1614824
    float_data: -0.24468218
    float_data: -0.15341651
    float_data: 0.2423753
    float_data: -0.017936781
    float_data: -0.081335425
    float_data: 0.056529403
    float_data: 0.19174185
    float_data: -0.1759524
    float_data: -0.19046223
    float_data: 0.24421626
    float_data: -0.13329734
    float_data: -0.02274802
    float_data: 0.05585935
    float_data: -0.07899709
    float_data: 0.03285048
    float_data: -0.18785429
    float_data: -0.027548775
    float_data: 0.21482185
    float_data: -0.07955361
    float_data: -0.10783695
    float_data: -0.18628609
    float_data: -0.2378007
    float_data: 0.22615421
    float_data: 0.10210274
    float_data: 0.0071381656
    float_data: 0.09819452
    float_data: -0.0840701
    float_data: -0.15583374
    float_data: 0.030873168
    float_data: -0.010725051
    float_data: 0.13105333
    float_data: 0.08787021
    float_data: 0.27629468
    float_data: -0.16511633
    float_data: -0.015552368
    float_data: -0.1947239
    float_data: -0.054473042
    float_data: 0.20014217
    float_data: 0.1584191
    float_data: 0.1106196
    float_data: 0.15400007
    float_data: 0.24526398
    float_data: 0.13055944
    float_data: 0.087242946
    float_data: -0.2038117
    float_data: -0.13245219
    float_data: 0.13798866
    float_data: 0.033279683
    float_data: -0.20022736
    float_data: 0.005162631
    float_data: -0.23293905
    float_data: 0.14838135
    float_data: -0.053200077
    float_data: -0.19148964
    float_data: -0.0057394346
    float_data: -0.13530493
    float_data: 0.20968571
    float_data: -0.18177778
    float_data: -0.02787733
    float_data: 0.0068932152
    float_data: -0.16390896
    float_data: -0.21241364
    float_data: -0.07233189
    float_data: -0.09457751
    float_data: 0.010973625
    float_data: 0.0075612366
    float_data: 0.040008925
    float_data: 0.23021784
    float_data: -0.061955303
    float_data: 0.2325002
    float_data: 0.035451233
    float_data: 0.25965858
    float_data: -0.065955706
    float_data: -0.08248967
    float_data: 0.1568628
    float_data: -0.1408184
    float_data: -0.14481187
    float_data: -0.009753475
    float_data: -0.2464318
    float_data: 0.06468574
    float_data: 0.13951907
    float_data: 0.07195847
    float_data: 0.25359374
    float_data: -0.15591486
    float_data: 0.21168832
    float_data: 0.16859291
    float_data: -0.09056538
    float_data: 0.011624159
    float_data: 0.16691625
    float_data: -0.0349285
    float_data: -0.1457481
    float_data: -0.11492861
    float_data: 0.09776755
    float_data: 0.034355395
    float_data: 0.21198888
    float_data: 0.17004897
    float_data: -0.23833933
    float_data: 0.088966645
    float_data: -0.16528389
    float_data: -0.1860708
    float_data: 0.022302866
    float_data: -0.033877607
    float_data: 0.076337285
    float_data: 0.00062352436
    float_data: -0.18181689
    float_data: 0.19460243
    float_data: 0.14184745
    float_data: 0.114718586
    float_data: -0.15983075
    float_data: -0.08714509
    float_data: -0.05826925
    float_data: 0.24611296
    float_data: -0.09370868
    float_data: 0.10460285
    float_data: 0.18893957
    float_data: -0.06247025
    float_data: -0.0025047732
    float_data: 0.08829149
    float_data: 0.21455945
    float_data: 0.10093447
    float_data: 0.08401658
    float_data: -0.08202359
    float_data: 0.16078833
    float_data: 0.2363731
    float_data: 0.13590695
    float_data: 0.025200166
    float_data: -0.17273043
    float_data: -0.11645518
    float_data: -0.061317503
    float_data: -0.058338102
    float_data: -0.029495895
    float_data: -0.10383581
    float_data: -0.105666995
    float_data: -0.18599904
    float_data: -0.1416606
    float_data: 0.1412574
    float_data: 0.0965231
    float_data: 0.20989937
    float_data: 0.064783394
    float_data: 0.21018262
    float_data: 0.10316577
    float_data: 0.24033248
    float_data: -0.22457588
    float_data: -0.108072005
    float_data: 0.20637614
    float_data: -0.05837771
    float_data: -0.11818236
    float_data: 0.04338883
    float_data: 0.17085028
    float_data: 0.24595156
    float_data: 0.103075914
    float_data: -0.156169
    float_data: -0.18821913
    float_data: -0.22823235
    float_data: -0.20135379
    float_data: -0.09359979
    float_data: -0.12793691
    float_data: 0.09590393
    float_data: 0.036138713
    float_data: 0.2055379
    float_data: 0.079685524
    float_data: -0.11098677
    float_data: -0.04271522
    float_data: -0.007230878
    float_data: 0.19300961
    float_data: 0.052534
    float_data: -0.10610393
    float_data: -0.13646528
    float_data: -0.07373692
    float_data: 0.15640533
    float_data: 0.1254139
    float_data: -0.122783676
    float_data: -0.045492876
    float_data: -0.23282063
    float_data: -0.23070079
    float_data: 0.045669265
    float_data: 0.089910455
    float_data: -0.19502386
    float_data: -0.11495996
    float_data: 0.053291682
    float_data: -0.13871598
    float_data: 0.19273174
    float_data: 0.16295213
    float_data: -0.13996631
    float_data: -0.2213875
    float_data: 0.14355129
    float_data: 0.14847326
    float_data: -0.22709283
    float_data: -0.23022592
    float_data: -0.07651768
    float_data: -0.11301575
    float_data: -0.0033976436
    float_data: -0.15764056
    float_data: -0.198056
    float_data: 0.20885833
    float_data: 0.0011919499
    float_data: -0.15367872
    float_data: -0.20685565
    float_data: 0.053949155
    float_data: 0.10460157
    float_data: -0.18831545
    float_data: -0.1488472
    float_data: -0.21192977
    float_data: -0.21264967
    float_data: -0.14723665
    float_data: 0.22195938
    float_data: 0.13094263
    float_data: -0.20650177
    float_data: -0.23802233
    float_data: -0.14293344
    float_data: 0.0402545
    float_data: 0.111812025
    float_data: -0.11848869
    float_data: 0.12449457
    float_data: -0.095923
    float_data: 0.12748799
    float_data: 0.027601909
    float_data: 0.2367282
    float_data: 0.31358695
    float_data: 0.026346646
    float_data: 0.001278938
    float_data: -0.21947867
    float_data: 0.19883882
    float_data: 0.08402692
    float_data: 0.26802734
    float_data: -0.0083860755
    float_data: -0.05692358
    float_data: 0.024281085
    float_data: -0.012436628
    float_data: 0.275438
    float_data: 0.072379515
    float_data: 0.101928264
    float_data: 0.20630856
    float_data: -0.0051297345
    float_data: -0.08611884
    float_data: 0.07613291
    float_data: 0.25700215
    float_data: 0.01870495
    float_data: -0.03279227
    float_data: -0.28448936
    float_data: -0.21967083
    float_data: 0.093697436
    float_data: 0.1914861
    float_data: 0.09373625
    float_data: 0.15395753
    float_data: -0.028560102
    float_data: 0.041717693
    float_data: 0.09868838
    float_data: -0.0054122405
    float_data: 0.10711794
    float_data: -0.12346566
    float_data: -0.21651998
    float_data: 0.1213434
    float_data: -0.15764666
    float_data: 0.17170195
    float_data: 0.15877533
    float_data: 0.02256609
    float_data: -0.058913514
    float_data: -0.19195923
    float_data: 0.02383229
    float_data: 0.022310369
    float_data: 0.1550982
    float_data: 0.05662638
    float_data: 0.18959332
    float_data: 0.17784356
    float_data: -0.2479255
    float_data: -0.11573937
    float_data: -0.17491671
    float_data: -0.13742687
    float_data: 0.014946138
    float_data: -0.1290139
    float_data: -0.110037595
    float_data: 0.0325545
    float_data: -0.18466319
    float_data: 0.21084371
    float_data: 0.128313
    float_data: -0.013070473
    float_data: 0.1510139
    float_data: 0.11344348
    float_data: 0.18055645
    float_data: 0.067153655
    float_data: 0.20628434
    float_data: -0.22677712
    float_data: 0.023216706
    float_data: 0.10033639
    float_data: -0.13756432
    float_data: 0.25885135
    float_data: -0.1454665
    float_data: 0.061018787
    float_data: 0.251982
    float_data: -0.18157381
    float_data: 0.08413035
    float_data: 0.098615706
    float_data: 0.06708305
    float_data: 0.12124614
    float_data: 0.08314866
    float_data: 0.086895525
    float_data: -0.10939171
    float_data: -0.08461887
    float_data: 0.21490179
    float_data: 0.13185231
    float_data: 0.20985466
    float_data: -0.03145105
    float_data: 0.23610136
    float_data: 0.17228621
    float_data: -0.13685755
    float_data: -0.05820868
    float_data: -0.025816679
    float_data: -0.16391474
    float_data: -0.041042414
    float_data: -0.1036503
    float_data: 0.21239272
    float_data: -0.24909908
    float_data: 0.19730458
    float_data: 0.21861142
    float_data: 0.112347096
    float_data: -0.1869663
    float_data: 0.054784577
    float_data: 0.020241253
    float_data: -0.032183267
    float_data: -0.10564773
    float_data: -0.27350804
    float_data: 0.25056714
    float_data: 0.14100023
    float_data: 0.017750967
    float_data: 0.17243749
    float_data: 0.1000458
    float_data: -0.18257713
    float_data: -0.13595569
    float_data: -0.20504574
    float_data: -0.13058048
    float_data: 0.10893339
    float_data: 0.18806946
    float_data: -0.143144
    float_data: 0.20948187
    float_data: -0.042394347
    float_data: -0.09827999
    float_data: -0.25314945
    float_data: -0.005267951
    float_data: 0.14139593
    float_data: -0.17142218
    float_data: -0.067771696
    float_data: -0.24470496
    float_data: 0.20096636
    float_data: -0.08502686
    float_data: -0.11623597
    float_data: 0.10552028
    float_data: 0.107466325
    float_data: 0.0023855441
    float_data: 0.03611296
    float_data: 0.10565567
    float_data: 0.20860343
    float_data: 0.30051926
    float_data: 0.17719007
    float_data: -0.031990826
    float_data: -0.02455324
    float_data: 0.2137255
    float_data: -0.084791854
    float_data: -0.03045845
    float_data: 0.009292901
    float_data: 0.11324495
    float_data: 0.028420549
    float_data: 0.3406058
    float_data: 0.06373156
    float_data: -0.07232635
    float_data: 0.1052866
    float_data: 0.042504404
    float_data: -0.32395086
    float_data: -0.114074826
    float_data: -0.04067743
    float_data: 0.07239292
    float_data: 0.2135517
    float_data: -0.05077549
    float_data: -0.07905767
    float_data: -0.01270698
    float_data: 0.17921618
    float_data: 0.043070614
    float_data: -0.05134726
    float_data: -0.042190183
    float_data: -0.098894045
    float_data: 0.12901962
    float_data: 0.02842792
    float_data: -0.13773632
    float_data: -0.08380765
    float_data: -0.019391205
    float_data: -0.05408333
    float_data: -0.1781546
    float_data: -0.13300656
    float_data: -0.19955099
    float_data: 0.0033817291
    float_data: 0.254698
    float_data: -0.007383777
    float_data: -0.039021675
    float_data: 0.027002659
    float_data: 0.19423053
    float_data: 0.24092354
    float_data: -0.13766025
    float_data: -0.11259409
    float_data: -0.21507356
    float_data: -0.1690085
    float_data: 0.08599529
    float_data: 0.21313539
    float_data: -0.041979738
    float_data: 0.22198087
    float_data: -0.0049065696
    float_data: -0.1800624
    float_data: -0.16690284
    float_data: -0.20752002
    float_data: -0.13426407
    float_data: -0.14325887
    float_data: 0.30350706
    float_data: -0.009131028
    float_data: 0.33821514
    float_data: 0.05993063
    float_data: -0.24174163
    float_data: -0.10213699
    float_data: 0.2583333
    float_data: 0.070019305
    float_data: -0.24034773
    float_data: 0.04889673
    float_data: -0.19343102
    float_data: 0.26012614
    float_data: -0.12902297
    float_data: 0.04183773
    float_data: -0.118098244
    float_data: -0.20629692
    float_data: 0.040666454
    float_data: 0.29857397
    float_data: 0.24202669
    float_data: -0.19909161
    float_data: 0.28926954
    float_data: 0.041180212
    float_data: 0.104551695
    float_data: -0.1340807
    float_data: -0.16868064
    float_data: 0.14002545
    float_data: -0.22344796
    float_data: 0.18883485
    float_data: -0.03785301
    float_data: 0.21130604
    float_data: 0.03327481
    float_data: -0.25470775
    float_data: 0.09897804
    float_data: -0.20034291
    float_data: 0.16763169
    float_data: 0.24257608
    float_data: 0.09184367
    float_data: 0.059330232
    float_data: -0.23112935
    float_data: 0.06511849
    float_data: -0.032494366
    float_data: 0.1800968
    float_data: -0.105061054
    float_data: 0.14269698
    float_data: 0.10279317
    float_data: 0.12306458
    float_data: 0.0012654678
    float_data: 0.001977861
    float_data: -0.046884883
    float_data: 0.09518239
    float_data: 0.06613756
    float_data: -0.22331332
    float_data: 0.19947328
    float_data: 0.23848502
    float_data: 0.024596214
    float_data: -0.08262542
    float_data: -0.2388296
    float_data: 0.16701224
    float_data: -0.09892589
    float_data: -0.1929749
    float_data: 0.113325655
    float_data: -0.21634775
    float_data: -0.15488793
    float_data: 0.1593572
    float_data: 0.037904732
    float_data: 0.0042150356
    float_data: 0.0128209805
    float_data: -0.24162519
    float_data: -0.22420555
    float_data: -0.1359329
    float_data: -0.08325714
    float_data: 0.07207155
    float_data: 0.18586688
    float_data: 0.10868281
    float_data: -0.21103781
    float_data: 0.24532321
    float_data: 0.21066828
    float_data: -0.0594419
    float_data: -0.0011590848
    float_data: -0.013460934
    float_data: 0.12138003
    float_data: -0.22146782
    float_data: -0.13789049
    float_data: 0.036696136
    float_data: -0.13833158
    float_data: 0.12965983
    float_data: -0.17204222
    float_data: 0.15813233
    float_data: 0.014524162
    float_data: -0.18391784
    float_data: -0.18294722
    float_data: 0.21081293
    float_data: 0.14447355
    float_data: -0.04507962
    float_data: 0.026725613
    float_data: 0.1343258
    float_data: -0.17319924
    float_data: -0.10400647
    float_data: -0.1530645
    float_data: -0.052976742
    float_data: -0.22477676
    float_data: -0.080854595
    float_data: -0.22271688
    float_data: -0.24514352
    float_data: 0.1409095
